{
  "trainingLogs": [
    {
      "id": 1,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.01",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": [
        "정종원",
        "김찬우",
        "이선재",
        "김영민",
        "이은솔",
        "한지선",
        "오승훈",
        "김성우"
      ],
      "description": "금일은 이번 학기 마지막 정규 운동으로 8분이 참여해주셨습니다.\n 훈련은 몸풀기 후 구르기, 익히기, 굳히기, 자유대련 순으로 진행하여 행복유도로 마무리 했습니다.\n\n  추운 날씨에 운동하면 부상을 입기 쉬우니 몸을 잘 풀어줘야 한다고 강조하셔서 오늘은 더 열심히 몸풀기를 하였습니다. 스트레칭을 하다가 승훈 선배가 발가락이 다치기 쉽다고 해서 발가락까지 꼼꼼하게 잘 풀어주었습니다.\n  이후 구르기를 했는데 저한테는 아직도 어려운 동작이 많아서 따로 연습할 필요성을 느꼈습니다. 오늘은 특히 구르기가 안되서 옆 도랑에 빠질 뻔 했습니다.\n  구르기 후 익히기를 2-30분 정도 진행했습니다. 처음 들어왔을 때는 밭다리만 배워서 익히기 때 밭다리만 연습했는데 지금은 발목받치기, 양팔엎어치기까지 배워서 뭘 연습할지 고민하게 됩니다. 밭다리후리기는 이제 몸에 좀 익은 것 같은데 양팔엎어치기는 배운지 얼마 안돼 실전에서 쓰기 어려운 것 같습니다. 언젠가 대련 때 멋지게 엎어치기를 완성시키는게 제 꿈이 되었습니다.😁\n 굳히기는 밀어내기 식으로 4번을 연이어 했는데 한 번만 해도 힘든 굳히기를 4번이나 하니 땀도 많이 나고 힘들었습니다. 마지막엔 목 조르기를 당했는데 탭 칠 힘도 없어서 죽을 뻔 했습니다.🥺 그래도 굳히기를 제일 좋아해서 재밌게 한 것 같습니다.\n 자유대련은 1-2팀 씩 진행하였습니다. 예전에는 실전에서 기술을 쓰기가 어려워 상대가 넘기라고 다리를 내어줘도 넘기지 못했는데, 오늘은 많이 익숙해진 밭다리후리기로 상대를 몇 번 넘기게 되었습니다. 기술을 걸 때는 상대에게 몸을 밀착해야 힘이 더 잘 전달이 되는 것 같습니다.\n\n 마지막에는 행복유도를 진행했습니다.  무릎을 꿇고 상대의 깃을 양손으로 먼저 잡는 게임과 일어서서 상대의 무릎을 먼저 터치하는 게임을 했습니다. 5세트 씩 진행했는데 세트에서 진 사람은 버피테스트 5개씩 수행하였습니다.\n행복유도는 가볍게 할 수 있으면서도 숨도 많이 차서 마무리 운동으로 좋았고 게임 형식이라 상대방과 즐겁게 할 수 있다는 점이 장점인 것 같습니다.\n\n 행복유도를 끝으로 이번 정규 운동은 마무리가 되었습니다. 지호 부원들도 시험도 잘 보시고 대회 나가시는 분들은 좋은 성적 얻으셔서 한 해를 행복하게 잘 마무리 하셨으면 좋겠습니다.\n내일 오전에는 눈이 온다고 합니다.❄️ 요즘 너무 추운 날씨인데 따뜻하게 입고 감기 걸리지 않게 조심하세요.😁 내년 봄에도 건강한 모습으로 즐겁게 운동하면 좋겠습니다. 다들 고생 많으셨습니다!!"
    },

    {
      "id": 2,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.02",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": [
        "정종원",
        "이준혁",
        "이진수",
        "우승우",
        "정명진",
        "이은솔",
        "한지선",
        "윤선재",
        "오승훈"
      ],
      "description": "11월의 마지막 날, 갑자기 날씨가 많이 추워졌습니다.❄️ 추워진 날씨에 몸에 열심히 열을 내기 위해 오늘의 운동은 몸풀기, 구르기, 익히기, 초익히기, 굳히기, 자유대련 순으로 진행되었습니다. 평소에는 익히기 후 바로 굳히기에 들어갔지만 12월에 개최되는 대회를 위해 빠르게 기술에 들어가는 연습을 위해 초익히기도 진행하였습니다. 20초 단위로 빠른 속도로 자신이 자신있는 기술을 보다 정확한 자세로 들어갈 수 있도록 연습을 했습니다. 평소의 익히기를 통해서는 정확한 자세를 위주로 연습을 했다면 초 익히기에서는 실제로 빠르게 기술을 사용할 수 있도록 하는 훈련이기 때문에 많은 도움이 되는 것 같습니다.\n\n아직 발목이 다 낫지 않아서🥺 굳히기와 자유대련에 거의 참여하지는 못했지만 부원들의 굳히기와 자유대련을 보면서 많은 것을 배울 수 있었습니다. 특히 허리 기술과 다리 기술을 사용하고 싶어서 열심히 익히기를 하던 분들이 실제에서 기술을 성공하는 모습을 보면 제가 성공을 한 마냥 저도 같이 기쁘게 박수를 치게 됩니다.😁 날씨가 추워져서 그런지 아프거나 다치는 부원들이 많아져서 마음이 안좋습니다.🤒 다들 이번주 마지막 운동이 끝난 후 잠시 쉬는 동안 회복하고 건강한 모습으로 다음 운동에 만날 수 있으면 좋겠습니다. 다들 보고 싶습니다!❣️\n\n오늘의 마무리 운동도 사람 수에 맞추어 배밀기를 진행했습니다. 배밀기 시간은 40개가 넘어가면서부터 팔이 너무너무 힘들어지지만 마지막까지 해내고 나면 뿌듯하고 팔이 저려옵니다. 다들 힘들겠지만 큰 소리로 숫자도 함께 세고 기합도 크게 넣는 부원이 되어봅시다! 돌아오는 금요일의 마지막 공식 운동에는 더 많은 분들이 참여하셔서 즐겁게 함께 운동 했으면 좋겠습니다. 다들 추운 날씨에 꼭꼭 잘 입고 따듯한 연말이 됩시다☃️🎄"
    },
    {
      "id": 3,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.03",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": [
        "정종원",
        "김찬우",
        "이선재",
        "김영민",
        "이은솔",
        "한지선",
        "오승훈",
        "김성우"
      ],
      "description": ""
    },
    {
      "id": 4,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.04",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": [
        "정종원",
        "김찬우",
        "이선재",
        "김영민",
        "이은솔",
        "한지선",
        "오승훈",
        "김성우"
      ],
      "description": ""
    },
    {
      "id": 5,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.05",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": [
        "정종원",
        "김찬우",
        "이선재",
        "김영민",
        "이은솔",
        "한지선",
        "오승훈",
        "김성우"
      ],
      "description": ""
    },
    {
      "id": 6,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.06",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": [
        "정종원",
        "김찬우",
        "이선재",
        "김영민",
        "이은솔",
        "한지선",
        "오승훈",
        "김성우"
      ],
      "description": ""
    },
    {
      "id": 7,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.07",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": ["", ""],
      "description": ""
    },
    {
      "id": 8,
      "imgSrcs": ["demo.jpg", "demo1.jpg"],
      "dateTime": "2022.10.08",
      "title": "🥋지호 훈련일지 🥋",
      "subTitle": ["", ""],
      "description": ""
    }
  ]
}
